iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/УБХПлощадки/УБХПлощадки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УБХПлощадки</name>
  <comment>Объекты ПБК</comment>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.УБХСтатусы</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.УБХРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Район</name>
    <type>
      <types>CatalogRef.УБХАдминистративныеРайоны</types>
    </type>
  </attributes>
  <attributes>
    <name>Ветровой</name>
    <type>
      <types>EnumRef.УБХВетровыеРайоныУровни</types>
    </type>
  </attributes>
  <attributes>
    <name>Снеговой</name>
    <type>
      <types>EnumRef.УБХСнеговыеРайоныУровни</types>
    </type>
  </attributes>
  <attributes>
    <name>Гололедный</name>
    <type>
      <types>EnumRef.УБХГололедныеРайоныУровни</types>
    </type>
  </attributes>
  <attributes>
    <name>Сейсмический</name>
    <type>
      <types>EnumRef.УБХСейсмическиеРегионыУровнии</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПокос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяОпашка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПСПИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяАншлаги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеОгражденияТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеВЛЭСТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМестности</name>
    <type>
      <types>EnumRef.УБХТипыМестности</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес1С</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресФИАС1С</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоАМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНГ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНГ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЕСУП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторNRI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторSAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодМестоположения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеОграждения1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеВЛЭС1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыПлощадки</name>
    <attributes>
      <name>ОбъектПлощадки</name>
      <type>
        <types>DefinedType.УБХОбъектыПлощадки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

iTower_20__GIS_Управление_пространственными_данными/src/InformationRegisters/УБХОбъектыПлощадок/УБХОбъектыПлощадок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБХОбъектыПлощадок</name>
  <dimensions>
    <name>Площадка</name>
    <type>
      <types>CatalogRef.УБХПлощадки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПлощадки</name>
    <type>
      <types>DefinedType.УБХОбъектыПлощадки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/УБХПлощадки/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	КоличествоАМС = 0;
	Для Каждого СтрокаТЧ Из ОбъектыПлощадки Цикл
		
		Если ТипЗнч(СТрокаТЧ.ОбъектПлощадки) = Тип("СправочникСсылка.УБХАМС") Тогда
			КоличествоАМС = КоличествоАМС + 1;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
	
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УБХОбъектыПлощадок");
	ЭлементБлокировки.УстановитьЗначение("Площадка", Ссылка);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
 
	НаборЗаписей = РегистрыСведений.УБХОбъектыПлощадок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Площадка.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	ТаблицаОбъектыПлощадки = ОбъектыПлощадки.Выгрузить();
	ТаблицаОбъектыПлощадки.Колонки.Добавить("Площадка", Новый ОписаниеТипов("СправочникСсылка.УБХПлощадки"));
	ТаблицаОбъектыПлощадки.ЗаполнитьЗначения(Ссылка, "Площадка");
	
	НаборЗаписей.Загрузить(ТаблицаОбъектыПлощадки);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецЕсли
